In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/NO/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [5]:
df

      Parámetro       Fecha  valor Unidad
0           NaN         NaN    NaN    NaN
1            NO  2018-03-02  0.002    ppm
2            NO  2018-03-02  0.002    ppm
3            NO  2018-03-02  0.002    ppm
4            NO  2018-03-02  0.002    ppm
...         ...         ...    ...    ...
16899        NO  2020-03-02  0.002    ppm
16900        NO  2020-03-02  0.004    ppm
16901        NO  2020-03-02  0.004    ppm
16902        NO  2020-03-02  0.003    ppm
16903        NO  2020-03-02  0.002    ppm

[16904 rows x 4 columns]

Dropping empty instances

In [6]:
df.dropna(how='all', inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16903 entries, 1 to 16903
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  16903 non-null  object
 1   Fecha      16903 non-null  object
 2   valor      16903 non-null  float64
 3   Unidad     16903 non-null  object
dtypes: float64(1), object(3)
memory usage: 660.3+ KB

Creating the complete dataset

In [8]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [9]:
df

      Parámetro       Fecha  valor Unidad
1            NO  2018-03-02  0.002    ppm
2            NO  2018-03-02  0.002    ppm
3            NO  2018-03-02  0.002    ppm
4            NO  2018-03-02  0.002    ppm
5            NO  2018-03-02  0.002    ppm
...         ...         ...    ...    ...
27752        NO  2025-03-09  0.000    ppm
27753        NO  2025-03-09  0.000    ppm
27754        NO  2025-03-09  0.000    ppm
27755        NO  2025-03-09  0.000    ppm
27756        NO  2025-03-09  0.000    ppm

[107114 rows x 4 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 107114 entries, 1 to 27756
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Parámetro  107114 non-null  object
 1   Fecha      107114 non-null  object
 2   valor      107114 non-null  float64
 3   Unidad     107114 non-null  object
dtypes: float64(1), object(3)
memory usage: 4.1+ MB

Dropping unnecessary columns

In [11]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 107114 entries, 1 to 27756
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Fecha   107114 non-null  object
 1   valor   107114 non-null  float64
dtypes: float64(1), object(1)
memory usage: 2.5+ MB

Formating dates

In [13]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [14]:
df.sort_values(by="Fecha", inplace=True)

In [15]:
df.head()

        Fecha  valor
24 2008-11-01  0.002
23 2008-11-01  0.003
22 2008-11-01  0.005
21 2008-11-01  0.007
20 2008-11-01  0.009

Changing column names

In [16]:
df.rename(columns={"valor":"NO"}, inplace=True)

In [17]:
df

           Fecha     NO
24    2008-11-01  0.002
23    2008-11-01  0.003
22    2008-11-01  0.005
21    2008-11-01  0.007
20    2008-11-01  0.009
...          ...    ...
27734 2025-03-09  0.000
27733 2025-03-09  0.000
27755 2025-03-09  0.000
27743 2025-03-09  0.000
27756 2025-03-09  0.000

[107114 rows x 2 columns]

Grouping per day and taking in consideration the average

In [18]:
df = df.groupby("Fecha", as_index=False).mean()

In [19]:
df

          Fecha        NO
0    2008-11-01  0.002542
1    2008-11-02  0.002476
2    2008-11-03  0.004000
3    2008-11-04  0.003500
4    2008-11-05  0.003478
...         ...       ...
3794 2025-03-05  0.000000
3795 2025-03-06  0.000000
3796 2025-03-07  0.000000
3797 2025-03-08  0.000000
3798 2025-03-09  0.000000

[3799 rows x 2 columns]

Transformation ppm to ppb

In [20]:
df["NO"] = df["NO"]*1000

In [21]:
df

          Fecha        NO
0    2008-11-01  2.541667
1    2008-11-02  2.476190
2    2008-11-03  4.000000
3    2008-11-04  3.500000
4    2008-11-05  3.478261
...         ...       ...
3794 2025-03-05  0.000000
3795 2025-03-06  0.000000
3796 2025-03-07  0.000000
3797 2025-03-08  0.000000
3798 2025-03-09  0.000000

[3799 rows x 2 columns]

In [22]:
df.describe()

                               Fecha           NO
count                           3799  3799.000000
mean   2016-09-25 09:01:39.499868416    10.373530
min              2008-11-01 00:00:00   -20.000000
25%              2012-08-14 12:00:00     1.154762
50%              2015-12-15 00:00:00     7.520833
75%              2020-03-17 12:00:00    13.906250
max              2025-03-09 00:00:00   199.214286
std                              NaN    14.341727

In [23]:
df.to_csv(PATH + "NO_complete.csv", index=False)

In [24]:
df = df[(df["Fecha"].dt.year >= 2018) & (df["Fecha"].dt.month >= 3) & (df["Fecha"].dt.day >= 2)]

In [25]:
df

          Fecha        NO
2114 2018-03-02  6.250000
2115 2018-03-03  4.875000
2116 2018-03-04  2.666667
2117 2018-03-05  3.958333
2118 2018-03-06  5.375000
...         ...       ...
3794 2025-03-05  0.000000
3795 2025-03-06  0.000000
3796 2025-03-07  0.000000
3797 2025-03-08  0.000000
3798 2025-03-09  0.000000

[1352 rows x 2 columns]

In [26]:
df.to_csv(PATH + "NO.csv", index=False)